Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMinimcds_regdef.h
/**
 * \file IfxMinimcds_regdef.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:15:04 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Minimcds_Registers MinimcdsRegisters
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Minimcds_Registers_Bitfields Bitfields
 * \ingroup IfxLld_Minimcds_Registers
 * 
 * \defgroup IfxLld_Minimcds_Registers_union Register unions
 * \ingroup IfxLld_Minimcds_Registers
 * 
 * \defgroup IfxLld_Minimcds_Registers_struct Memory map
 * \ingroup IfxLld_Minimcds_Registers
 */
#ifndef IFXMINIMCDS_REGDEF_H
#define IFXMINIMCDS_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_Bitfields
 * \{  */
/** \brief Clock Control Register */
typedef struct _Ifx_MINIMCDS_CLC_Bits
{
    Ifx_UReg_32Bit DISR:1;            /**< \brief [0:0] Disable Request Bit - DISR (rw) */
    Ifx_UReg_32Bit DISS:1;            /**< \brief [1:1] Disable Status Bit - DISS (rh) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_MINIMCDS_CLC_Bits;

/** \brief MCDS Control Register */
typedef struct _Ifx_MINIMCDS_CT_Bits
{
    Ifx_UReg_32Bit reserved_0:5;      /**< \brief [4:0] \internal Reserved */
    Ifx_UReg_32Bit KOK:1;             /**< \brief [5:5] Key OK Flag - KOK (rh) */
    Ifx_UReg_32Bit reserved_6:1;      /**< \brief [6:6] \internal Reserved */
    Ifx_UReg_32Bit KAV:1;             /**< \brief [7:7] Key Available Flag - KAV (rh) */
    Ifx_UReg_32Bit reserved_8:5;      /**< \brief [12:8] \internal Reserved */
    Ifx_UReg_32Bit EN:1;              /**< \brief [13:13] MCDS Enable Flag - EN (rh) */
    Ifx_UReg_32Bit CLRE:1;            /**< \brief [14:14] Clear MCDS Enable Flag - CLRE (w) */
    Ifx_UReg_32Bit SETE:1;            /**< \brief [15:15] Set MCDS Enable Flag - SETE (w) */
    Ifx_UReg_32Bit BED:1;             /**< \brief [16:16] Bus Error Disable Flag - BED (rw) */
    Ifx_UReg_32Bit reserved_17:2;     /**< \brief [18:17] \internal Reserved */
    Ifx_UReg_32Bit BED_P:1;           /**< \brief [19:19] Bus Error Disable Protection - BED_P (w) */
    Ifx_UReg_32Bit reserved_20:1;     /**< \brief [20:20] \internal Reserved */
    Ifx_UReg_32Bit IRA:1;             /**< \brief [21:21] Invalid Read Access Flag - IRA (rh) */
    Ifx_UReg_32Bit CLRI:1;            /**< \brief [22:22] Clear Invalid Access Bits - CLRI (w) */
    Ifx_UReg_32Bit IWA:1;             /**< \brief [23:23] Invalid Write Access Flag - IWA (rh) */
    Ifx_UReg_32Bit reserved_24:5;     /**< \brief [28:24] \internal Reserved */
    Ifx_UReg_32Bit RES:1;             /**< \brief [29:29] ${MINIMCDS_reset}Flag - RES (rh) */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit SETR:1;            /**< \brief [31:31] ${MINIMCDS_reset}Request Bit - SETR (w) */
} Ifx_MINIMCDS_CT_Bits;

/** \brief Trace Buffer Bottom Register */
typedef struct _Ifx_MINIMCDS_FIFOBOT_Bits
{
    Ifx_UReg_32Bit reserved_0:10;     /**< \brief [9:0] \internal Reserved */
    Ifx_UReg_32Bit BOTTOM:3;          /**< \brief [12:10] Trace Buffer lower Bound - BOTTOM (rw) */
    Ifx_UReg_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_MINIMCDS_FIFOBOT_Bits;

/** \brief Trace Buffer Control Register */
typedef struct _Ifx_MINIMCDS_FIFOCTL_Bits
{
    Ifx_UReg_32Bit TRG:1;             /**< \brief [0:0] Trigger Received Flag - TRG (rh) */
    Ifx_UReg_32Bit FFE:1;             /**< \brief [1:1] FIFO Feeder Empty - FFE (rh) */
    Ifx_UReg_32Bit reserved_2:7;      /**< \brief [8:2] \internal Reserved */
    Ifx_UReg_32Bit TRDIS:1;           /**< \brief [9:9] Trigger DisableFlag - TRDIS (rh) */
    Ifx_UReg_32Bit TRON:1;            /**< \brief [10:10] ClearTrigger DisableFlag - TRON (w) */
    Ifx_UReg_32Bit TROFF:1;           /**< \brief [11:11] SetTrigger DisableFlag - TROFF (w) */
    Ifx_UReg_32Bit reserved_12:1;     /**< \brief [12:12] \internal Reserved */
    Ifx_UReg_32Bit FLSH:1;            /**< \brief [13:13] FlushFlag - FLSH (rh) */
    Ifx_UReg_32Bit CLR:1;             /**< \brief [14:14] ClearFlushFlag - CLR (w) */
    Ifx_UReg_32Bit SET:1;             /**< \brief [15:15] SetFlushFlag - SET (w) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_MINIMCDS_FIFOCTL_Bits;

/** \brief Trace Buffer Write Pointer */
typedef struct _Ifx_MINIMCDS_FIFONOW_Bits
{
    Ifx_UReg_32Bit reserved_0:5;      /**< \brief [4:0] \internal Reserved */
    Ifx_UReg_32Bit NOW:8;             /**< \brief [12:5] Trace Buffer Current Write Pointer - NOW (rh) */
    Ifx_UReg_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_MINIMCDS_FIFONOW_Bits;

/** \brief FIFO Overflow Counter Register */
typedef struct _Ifx_MINIMCDS_FIFOOVRCNT_Bits
{
    Ifx_UReg_32Bit COUNT:8;           /**< \brief [7:0] FIFO Overflow Counter - COUNT (rh) */
    Ifx_UReg_32Bit reserved_8:7;      /**< \brief [14:8] \internal Reserved */
    Ifx_UReg_32Bit CLR:1;             /**< \brief [15:15] Clear counter - CLR (w) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_MINIMCDS_FIFOOVRCNT_Bits;

