Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMinimcds_regdef.h
/** \brief Trace Buffer PRE/POST Register */
typedef struct _Ifx_MINIMCDS_FIFOPRE_Bits
{
    Ifx_UReg_32Bit reserved_0:5;      /**< \brief [4:0] \internal Reserved */
    Ifx_UReg_32Bit PRE:8;             /**< \brief [12:5] Trace Buffer Pre-Trigger Area Size - PRE (rw) */
    Ifx_UReg_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_MINIMCDS_FIFOPRE_Bits;

/** \brief Trace Buffer Top Register */
typedef struct _Ifx_MINIMCDS_FIFOTOP_Bits
{
    Ifx_UReg_32Bit reserved_0:5;      /**< \brief [4:0] \internal Reserved */
    Ifx_UReg_32Bit TOP:8;             /**< \brief [12:5] Trace Buffer upper Bound - TOP (rw) */
    Ifx_UReg_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_MINIMCDS_FIFOTOP_Bits;

/** \brief Trace Buffer Comparator Register */
typedef struct _Ifx_MINIMCDS_FIFOWARN_Bits
{
    Ifx_UReg_32Bit reserved_0:5;      /**< \brief [4:0] \internal Reserved */
    Ifx_UReg_32Bit WARN:8;            /**< \brief [12:5] Trace Buffer Warn Level - WARN (rw) */
    Ifx_UReg_32Bit reserved_13:18;    /**< \brief [30:13] \internal Reserved */
    Ifx_UReg_32Bit EN:1;              /**< \brief [31:31] Enable Trigger Generation - EN (rw) */
} Ifx_MINIMCDS_FIFOWARN_Bits;

/** \brief Module Identification Register */
typedef struct _Ifx_MINIMCDS_ID_Bits
{
    Ifx_UReg_32Bit MOD_REV:8;         /**< \brief [7:0] Module Revision - MOD_REV (r) */
    Ifx_UReg_32Bit MOD_TYPE:8;        /**< \brief [15:8] Module Type - MOD_TYPE (r) */
    Ifx_UReg_32Bit MOD_NUMBER:16;     /**< \brief [31:16] Module Number - MOD_NUMBER (r) */
} Ifx_MINIMCDS_ID_Bits;

/** \brief Action Definition Register ${x} */
typedef struct _Ifx_MINIMCDS_MCX_ACT_Bits
{
    Ifx_UReg_32Bit AIS0:5;            /**< \brief [4:0] Action Input Selector - AIS${q} (rw) */
    Ifx_UReg_32Bit AIQ0:2;            /**< \brief [6:5] Action Input Qualifier - AIQ${q} (rw) */
    Ifx_UReg_32Bit LV0:1;             /**< \brief [7:7] Action Input Level Mode - LV${q} (rw) */
    Ifx_UReg_32Bit AIS1:5;            /**< \brief [12:8] Action Input Selector - AIS${q} (rw) */
    Ifx_UReg_32Bit AIQ1:2;            /**< \brief [14:13] Action Input Qualifier - AIQ${q} (rw) */
    Ifx_UReg_32Bit LV1:1;             /**< \brief [15:15] Action Input Level Mode - LV${q} (rw) */
    Ifx_UReg_32Bit AIS2:5;            /**< \brief [20:16] Action Input Selector - AIS${q} (rw) */
    Ifx_UReg_32Bit AIQ2:2;            /**< \brief [22:21] Action Input Qualifier - AIQ${q} (rw) */
    Ifx_UReg_32Bit LV2:1;             /**< \brief [23:23] Action Input Level Mode - LV${q} (rw) */
    Ifx_UReg_32Bit AIS3:5;            /**< \brief [28:24] Action Input Selector - AIS${q} (rw) */
    Ifx_UReg_32Bit AIQ3:2;            /**< \brief [30:29] Action Input Qualifier - AIQ${q} (rw) */
    Ifx_UReg_32Bit LV3:1;             /**< \brief [31:31] Action Input Level Mode - LV${q} (rw) */
} Ifx_MINIMCDS_MCX_ACT_Bits;

/** \brief Counter Control Register */
typedef struct _Ifx_MINIMCDS_MCX_CNT_CCL_Bits
{
    Ifx_UReg_32Bit INC0:7;            /**< \brief [6:0] Count Input Selector - INC${q} (rw) */
    Ifx_UReg_32Bit ILV0:1;            /**< \brief [7:7] Count Input Level Mode - ILV${q} (rw) */
    Ifx_UReg_32Bit CLR0:6;            /**< \brief [13:8] Clear Input Selector - CLR${q} (rw) */
    Ifx_UReg_32Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_32Bit CLV0:1;            /**< \brief [15:15] Clear Input Level Mode - CLV${q} (rw) */
    Ifx_UReg_32Bit INC1:7;            /**< \brief [22:16] Count Input Selector - INC${q} (rw) */
    Ifx_UReg_32Bit ILV1:1;            /**< \brief [23:23] Count Input Level Mode - ILV${q} (rw) */
    Ifx_UReg_32Bit CLR1:6;            /**< \brief [29:24] Clear Input Selector - CLR${q} (rw) */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit CLV1:1;            /**< \brief [31:31] Clear Input Level Mode - CLV${q} (rw) */
} Ifx_MINIMCDS_MCX_CNT_CCL_Bits;

/** \brief Current Count Register */
typedef struct _Ifx_MINIMCDS_MCX_CNT_CNT_Bits
{
    Ifx_UReg_32Bit COUNT:16;          /**< \brief [15:0] Current Counter - COUNT (rh) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_MINIMCDS_MCX_CNT_CNT_Bits;

/** \brief Counter Limit Register */
typedef struct _Ifx_MINIMCDS_MCX_CNT_LMT_Bits
{
    Ifx_UReg_32Bit LIMIT:16;          /**< \brief [15:0] Counter Limit - LIMIT (rw) */
    Ifx_UReg_32Bit reserved_16:14;    /**< \brief [29:16] \internal Reserved */
    Ifx_UReg_32Bit MOD0:1;            /**< \brief [30:30] Modulo Count Control - MOD${q} (rw) */
    Ifx_UReg_32Bit MOD1:1;            /**< \brief [31:31] Modulo Count Control - MOD${q} (rw) */
} Ifx_MINIMCDS_MCX_CNT_LMT_Bits;

/** \brief Event Definition Register ${x} */
typedef struct _Ifx_MINIMCDS_MCX_EVT_Bits
{
    Ifx_UReg_32Bit EIQ0:2;            /**< \brief [1:0] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ1:2;            /**< \brief [3:2] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ2:2;            /**< \brief [5:4] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ3:2;            /**< \brief [7:6] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ4:2;            /**< \brief [9:8] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ5:2;            /**< \brief [11:10] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ6:2;            /**< \brief [13:12] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ7:2;            /**< \brief [15:14] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ8:2;            /**< \brief [17:16] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ9:2;            /**< \brief [19:18] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ10:2;           /**< \brief [21:20] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ11:2;           /**< \brief [23:22] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ12:2;           /**< \brief [25:24] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ13:2;           /**< \brief [27:26] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ14:2;           /**< \brief [29:28] Event Input Qualifier - EIQ${q} (rw) */
    Ifx_UReg_32Bit EIQ15:2;           /**< \brief [31:30] Event Input Qualifier - EIQ${q} (rw) */
} Ifx_MINIMCDS_MCX_EVT_Bits;

/** \brief MCDS Signal Source Control */
typedef struct _Ifx_MINIMCDS_MUX_Bits
{
    Ifx_UReg_32Bit TMUX0:4;           /**< \brief [3:0] Trace Source Select 0 - TMUX0 (rw) */
    Ifx_UReg_32Bit reserved_4:3;      /**< \brief [6:4] \internal Reserved */
    Ifx_UReg_32Bit TM_P0:1;           /**< \brief [7:7] Trace Source Select ${z} Protection - TM${z}_P (w) */
    Ifx_UReg_32Bit TMUX1:4;           /**< \brief [11:8] Trace Source Select 1 - TMUX1 (rw) */
    Ifx_UReg_32Bit reserved_12:3;     /**< \brief [14:12] \internal Reserved */
    Ifx_UReg_32Bit TM_P1:1;           /**< \brief [15:15] Trace Source Select ${z} Protection - TM${z}_P (w) */
    Ifx_UReg_32Bit TMUX2:4;           /**< \brief [19:16] Trace Source Select 2 - TMUX2 (rw) */
    Ifx_UReg_32Bit reserved_20:3;     /**< \brief [22:20] \internal Reserved */
    Ifx_UReg_32Bit TM_P2:1;           /**< \brief [23:23] Trace Source Select ${z} Protection - TM${z}_P (w) */
    Ifx_UReg_32Bit TMUX3:4;           /**< \brief [27:24] Trace Source Select 3 - TMUX3 (rw) */
    Ifx_UReg_32Bit reserved_28:3;     /**< \brief [30:28] \internal Reserved */
    Ifx_UReg_32Bit TM_P3:1;           /**< \brief [31:31] Trace Source Select ${z} Protection - TM${z}_P (w) */
} Ifx_MINIMCDS_MUX_Bits;

/** \brief MCDS_TC Signal Source Control */
typedef struct _Ifx_MINIMCDS_MUX_TC_RC_Bits
{
    Ifx_UReg_32Bit TC_MUX0:2;         /**< \brief [1:0] TC_MUX Trace Source Select - TC_MUX${z} (rw) */
    Ifx_UReg_32Bit TC_MUX1:2;         /**< \brief [3:2] TC_MUX Trace Source Select - TC_MUX${z} (rw) */
    Ifx_UReg_32Bit TC_MUX2:2;         /**< \brief [5:4] TC_MUX Trace Source Select - TC_MUX${z} (rw) */
    Ifx_UReg_32Bit TC_MUX3:2;         /**< \brief [7:6] TC_MUX Trace Source Select - TC_MUX${z} (rw) */
    Ifx_UReg_32Bit TC_MUX4:2;         /**< \brief [9:8] TC_MUX Trace Source Select - TC_MUX${z} (rw) */
    Ifx_UReg_32Bit TC_MUX5:2;         /**< \brief [11:10] TC_MUX Trace Source Select - TC_MUX${z} (rw) */
    Ifx_UReg_32Bit reserved_12:3;     /**< \brief [14:12] \internal Reserved */
    Ifx_UReg_32Bit TC_TM_P:1;         /**< \brief [15:15] TC_MUX Trace Source Select Protection - TC_TM_P (w) */
    Ifx_UReg_32Bit reserved_16:8;     /**< \brief [23:16] \internal Reserved */
    Ifx_UReg_32Bit RC:1;              /**< \brief [24:24] Reference Clock Select - RC (rw) */
    Ifx_UReg_32Bit reserved_25:2;     /**< \brief [26:25] \internal Reserved */
    Ifx_UReg_32Bit RC_P:1;            /**< \brief [27:27] Reference Clock Select Protection - RC_P (w) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_MINIMCDS_MUX_TC_RC_Bits;

/** \brief OCDS Control and Status */
typedef struct _Ifx_MINIMCDS_OCS_Bits
{
    Ifx_UReg_32Bit reserved_0:24;     /**< \brief [23:0] \internal Reserved */
    Ifx_UReg_32Bit SUS:4;             /**< \brief [27:24] OCDS Suspend Control - SUS (rw) */
    Ifx_UReg_32Bit SUS_P:1;           /**< \brief [28:28] SUS Write Protection - SUS_P (w) */
    Ifx_UReg_32Bit SUSSTA:1;          /**< \brief [29:29] Suspend State(inverted busy_o) - SUSSTA (rh) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_MINIMCDS_OCS_Bits;

/** \brief Comparator Bound Register ${j} */
typedef struct _Ifx_MINIMCDS_TCX_AC_BND_Bits
{
    Ifx_UReg_32Bit BOUND:12;          /**< \brief [11:0] Mode Comparator range lower bound - BOUND (rw) */
    Ifx_UReg_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_MINIMCDS_TCX_AC_BND_Bits;

