Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMinimcds_regdef.h
/** \brief Comparator Mask Register ${j} */
typedef struct _Ifx_MINIMCDS_TCX_AC_MSK_Bits
{
    Ifx_UReg_32Bit SVM:1;             /**< \brief [0:0] Comparator bit mask for Supervisor Mode - SVM (rw) */
    Ifx_UReg_32Bit MASTER:4;          /**< \brief [4:1] Comparator bit mask for Master ID - MASTER (rw) */
    Ifx_UReg_32Bit SUBCHANNEL:7;      /**< \brief [11:5] Comparator bit mask for Sub-channel ID - SUBCHANNEL (rw) */
    Ifx_UReg_32Bit WR:1;              /**< \brief [12:12] Comparator bit mask for Direction Write - WR (rw) */
    Ifx_UReg_32Bit RD:1;              /**< \brief [13:13] Comparator bit mask for Direction Read - RD (rw) */
    Ifx_UReg_32Bit MSK:1;             /**< \brief [14:14] Bit mask for Transaction Type - MSK (rw) */
    Ifx_UReg_32Bit reserved_15:17;    /**< \brief [31:15] \internal Reserved */
} Ifx_MINIMCDS_TCX_AC_MSK_Bits;

/** \brief Comparator Range Register ${j} */
typedef struct _Ifx_MINIMCDS_TCX_AC_RNG_Bits
{
    Ifx_UReg_32Bit RANGE:12;          /**< \brief [11:0] Mode Comparator range size - RANGE (rw) */
    Ifx_UReg_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_MINIMCDS_TCX_AC_RNG_Bits;

/** \brief Compact Function Trace Register */
typedef struct _Ifx_MINIMCDS_TCX_CFT_Bits
{
    Ifx_UReg_32Bit VSHRT_FCT:10;      /**< \brief [9:0] Length of very short leaf function - VSHRT_FCT (rw) */
    Ifx_UReg_32Bit reserved_10:6;     /**< \brief [15:10] \internal Reserved */
    Ifx_UReg_32Bit SHRT_FCT:10;       /**< \brief [25:16] Length of short leaf function - SHRT_FCT (rw) */
    Ifx_UReg_32Bit reserved_26:6;     /**< \brief [31:26] \internal Reserved */
} Ifx_MINIMCDS_TCX_CFT_Bits;

/** \brief Current Instruction Pointer */
typedef struct _Ifx_MINIMCDS_TCX_CIP_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit CURRENT:31;        /**< \brief [31:1] Current Instruction Pointer - CURRENT (rh) */
} Ifx_MINIMCDS_TCX_CIP_Bits;

/** \brief Debug Status Register */
typedef struct _Ifx_MINIMCDS_TCX_DCSTS_Bits
{
    Ifx_UReg_32Bit SUS:1;             /**< \brief [0:0] Suspended Flag - SUS (rh) */
    Ifx_UReg_32Bit IDLE:1;            /**< \brief [1:1] Run Flag - IDLE (rh) */
    Ifx_UReg_32Bit HALT:1;            /**< \brief [2:2] Halted Flag - HALT (rh) */
    Ifx_UReg_32Bit ISR:1;             /**< \brief [3:3] Interrupt Service Flag - ISR (rh) */
    Ifx_UReg_32Bit HBRK:1;            /**< \brief [4:4] Hardware Break Flag - HBRK (rh) */
    Ifx_UReg_32Bit SBRK:1;            /**< \brief [5:5] Software Break Flag - SBRK (rh) */
    Ifx_UReg_32Bit reserved_6:1;      /**< \brief [6:6] \internal Reserved */
    Ifx_UReg_32Bit IEN:1;             /**< \brief [7:7] Interrupt Enable Flag - IEN (rh) */
    Ifx_UReg_32Bit DBGEN:1;           /**< \brief [8:8] Debug Enabled Flag - DBGEN (rh) */
    Ifx_UReg_32Bit CLKDIV:2;          /**< \brief [10:9] Current Clock Divider - CLKDIV (rh) */
    Ifx_UReg_32Bit reserved_11:21;    /**< \brief [31:11] \internal Reserved */
} Ifx_MINIMCDS_TCX_DCSTS_Bits;

/** \brief Comparator Bound Register ${j} */
typedef struct _Ifx_MINIMCDS_TCX_EA_BND_Bits
{
    Ifx_UReg_32Bit BOUND:32;          /**< \brief [31:0] Address Comparator range lower bound - BOUND (rw) */
} Ifx_MINIMCDS_TCX_EA_BND_Bits;

/** \brief Comparator Range Register ${j} */
typedef struct _Ifx_MINIMCDS_TCX_EA_RNG_Bits
{
    Ifx_UReg_32Bit RANGE:32;          /**< \brief [31:0] Address Comparator range size - RANGE (rw) */
} Ifx_MINIMCDS_TCX_EA_RNG_Bits;

/** \brief Comparator Bound Register ${j} */
typedef struct _Ifx_MINIMCDS_TCX_IP_BND_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit BOUND:31;          /**< \brief [31:1] IP Comparator range lower bound - BOUND (rw) */
} Ifx_MINIMCDS_TCX_IP_BND_Bits;

/** \brief Comparator Range Register ${j} */
typedef struct _Ifx_MINIMCDS_TCX_IP_RNG_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit RANGE:31;          /**< \brief [31:1] IP Comparator range size - RANGE (rw) */
} Ifx_MINIMCDS_TCX_IP_RNG_Bits;

/** \brief Comparator Bound Register ${j} */
typedef struct _Ifx_MINIMCDS_TCX_WD_BND_Bits
{
    Ifx_UReg_32Bit BOUND:32;          /**< \brief [31:0] Data Comparator range lower bound - BOUND (rw) */
} Ifx_MINIMCDS_TCX_WD_BND_Bits;

/** \brief Comparator Mask Register ${j} */
typedef struct _Ifx_MINIMCDS_TCX_WD_MSK_Bits
{
    Ifx_UReg_32Bit MASK:32;           /**< \brief [31:0] Data Comparator bit mask - MASK (rw) */
} Ifx_MINIMCDS_TCX_WD_MSK_Bits;

/** \brief Comparator Range Register ${j} */
typedef struct _Ifx_MINIMCDS_TCX_WD_RNG_Bits
{
    Ifx_UReg_32Bit RANGE:32;          /**< \brief [31:0] Data Comparator range size - RANGE (rw) */
} Ifx_MINIMCDS_TCX_WD_RNG_Bits;

/** \brief Comparator Sign Register ${j} */
typedef struct _Ifx_MINIMCDS_TCX_WD_SGN_Bits
{
    Ifx_UReg_32Bit SIGN:5;            /**< \brief [4:0] Bit number (1…31) of sign bit - SIGN (rw) */
    Ifx_UReg_32Bit reserved_5:15;     /**< \brief [19:5] \internal Reserved */
    Ifx_UReg_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_MINIMCDS_TCX_WD_SGN_Bits;

/** \brief Clock Counter Register */
typedef struct _Ifx_MINIMCDS_TSUEMUCNT_Bits
{
    Ifx_UReg_32Bit COUNT:32;          /**< \brief [31:0] Current Count Value - COUNT (rh) */
} Ifx_MINIMCDS_TSUEMUCNT_Bits;

/** \brief Clock Prescaler Register */
typedef struct _Ifx_MINIMCDS_TSUPRSCL_Bits
{
    Ifx_UReg_32Bit RELOAD:32;         /**< \brief [31:0] Prescaler Reload Value - RELOAD (rw) */
} Ifx_MINIMCDS_TSUPRSCL_Bits;

/** \brief Clock Counter Register */
typedef struct _Ifx_MINIMCDS_TSUREFCNT_Bits
{
    Ifx_UReg_32Bit COUNT:32;          /**< \brief [31:0] Current Count Value - COUNT (rh) */
} Ifx_MINIMCDS_TSUREFCNT_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_minimcds_union
 * \{   */
/** \brief Clock Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_CLC_Bits B;          /**< \brief Bitfield access */
} Ifx_MINIMCDS_CLC;

/** \brief MCDS Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_CT_Bits B;           /**< \brief Bitfield access */
} Ifx_MINIMCDS_CT;

/** \brief Trace Buffer Bottom Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_FIFOBOT_Bits B;      /**< \brief Bitfield access */
} Ifx_MINIMCDS_FIFOBOT;

/** \brief Trace Buffer Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_FIFOCTL_Bits B;      /**< \brief Bitfield access */
} Ifx_MINIMCDS_FIFOCTL;

