Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMinimcds_regdef.h
/** \brief Trace Buffer Write Pointer   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_FIFONOW_Bits B;      /**< \brief Bitfield access */
} Ifx_MINIMCDS_FIFONOW;

/** \brief FIFO Overflow Counter Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_FIFOOVRCNT_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_FIFOOVRCNT;

/** \brief Trace Buffer PRE/POST Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_FIFOPRE_Bits B;      /**< \brief Bitfield access */
} Ifx_MINIMCDS_FIFOPRE;

/** \brief Trace Buffer Top Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_FIFOTOP_Bits B;      /**< \brief Bitfield access */
} Ifx_MINIMCDS_FIFOTOP;

/** \brief Trace Buffer Comparator Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_FIFOWARN_Bits B;     /**< \brief Bitfield access */
} Ifx_MINIMCDS_FIFOWARN;

/** \brief Module Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_ID_Bits B;           /**< \brief Bitfield access */
} Ifx_MINIMCDS_ID;

/** \brief Action Definition Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_MCX_ACT_Bits B;      /**< \brief Bitfield access */
} Ifx_MINIMCDS_MCX_ACT;

/** \brief Counter Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_MCX_CNT_CCL_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_MCX_CNT_CCL;

/** \brief Current Count Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_MCX_CNT_CNT_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_MCX_CNT_CNT;

/** \brief Counter Limit Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_MCX_CNT_LMT_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_MCX_CNT_LMT;

/** \brief Event Definition Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_MCX_EVT_Bits B;      /**< \brief Bitfield access */
} Ifx_MINIMCDS_MCX_EVT;

/** \brief MCDS Signal Source Control   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_MUX_Bits B;          /**< \brief Bitfield access */
} Ifx_MINIMCDS_MUX;

/** \brief MCDS_TC Signal Source Control   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_MUX_TC_RC_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_MUX_TC_RC;

/** \brief OCDS Control and Status   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_OCS_Bits B;          /**< \brief Bitfield access */
} Ifx_MINIMCDS_OCS;

/** \brief Comparator Bound Register ${j}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_AC_BND_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_AC_BND;

/** \brief Comparator Mask Register ${j}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_AC_MSK_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_AC_MSK;

/** \brief Comparator Range Register ${j}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_AC_RNG_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_AC_RNG;

/** \brief Compact Function Trace Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_CFT_Bits B;      /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_CFT;

/** \brief Current Instruction Pointer   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_CIP_Bits B;      /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_CIP;

/** \brief Debug Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_DCSTS_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_DCSTS;

/** \brief Comparator Bound Register ${j}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_EA_BND_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_EA_BND;

/** \brief Comparator Range Register ${j}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_EA_RNG_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_EA_RNG;

/** \brief Comparator Bound Register ${j}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_IP_BND_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_IP_BND;

/** \brief Comparator Range Register ${j}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_IP_RNG_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_IP_RNG;

/** \brief Comparator Bound Register ${j}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_WD_BND_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_WD_BND;

/** \brief Comparator Mask Register ${j}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_WD_MSK_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_WD_MSK;

/** \brief Comparator Range Register ${j}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_WD_RNG_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_WD_RNG;

/** \brief Comparator Sign Register ${j}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TCX_WD_SGN_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TCX_WD_SGN;

/** \brief Clock Counter Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TSUEMUCNT_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TSUEMUCNT;

/** \brief Clock Prescaler Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TSUPRSCL_Bits B;     /**< \brief Bitfield access */
} Ifx_MINIMCDS_TSUPRSCL;

/** \brief Clock Counter Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MINIMCDS_TSUREFCNT_Bits B;    /**< \brief Bitfield access */
} Ifx_MINIMCDS_TSUREFCNT;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_MCX_CNT_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief CNT object */
typedef volatile struct _Ifx_MINIMCDS_MCX_CNT
{
       Ifx_MINIMCDS_MCX_CNT_CCL            CCL;                    /**< \brief 0, Counter Control Register*/
       Ifx_MINIMCDS_MCX_CNT_LMT            LMT;                    /**< \brief 4, Counter Limit Register*/
       Ifx_MINIMCDS_MCX_CNT_CNT            CNT;                    /**< \brief 8, Current Count Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MINIMCDS_MCX_CNT;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_MCX_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief MCX object */
typedef volatile struct _Ifx_MINIMCDS_MCX
{
       Ifx_MINIMCDS_MCX_EVT                EVT[16];                /**< \brief 0, Event Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_40[64];        /**< \brief 40, \internal Reserved */
       Ifx_MINIMCDS_MCX_ACT                ACT[42];                /**< \brief 80, Action Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_128[216];      /**< \brief 128, \internal Reserved */
       Ifx_MINIMCDS_MCX_CNT                CNT[8];                 /**< \brief 200, */
} Ifx_MINIMCDS_MCX;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_TCX_EA_struct
 * \{  */
/******************************************************************************/
/** \name Object L3
 * \{  */
/** \brief EA object */
typedef volatile struct _Ifx_MINIMCDS_TCX_EA
{
       Ifx_MINIMCDS_TCX_EA_BND             BND;                    /**< \brief 0, Comparator Bound Register ${j}*/
       Ifx_MINIMCDS_TCX_EA_RNG             RNG;                    /**< \brief 4, Comparator Range Register ${j}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MINIMCDS_TCX_EA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_TCX_WD_struct
 * \{  */
/******************************************************************************/
/** \name Object L4
 * \{  */
/** \brief WD object */
typedef volatile struct _Ifx_MINIMCDS_TCX_WD
{
       Ifx_MINIMCDS_TCX_WD_BND             BND;                    /**< \brief 0, Comparator Bound Register ${j}*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_MINIMCDS_TCX_WD_RNG             RNG;                    /**< \brief 8, Comparator Range Register ${j}*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_MINIMCDS_TCX_WD_MSK             MSK;                    /**< \brief 10, Comparator Mask Register ${j}*/
       Ifx_UReg_8Bit                       reserved_14[8];         /**< \brief 14, \internal Reserved */
       Ifx_MINIMCDS_TCX_WD_SGN             SGN;                    /**< \brief 1C, Comparator Sign Register ${j}*/
} Ifx_MINIMCDS_TCX_WD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_TCX_AC_struct
 * \{  */
/******************************************************************************/
/** \name Object L5
 * \{  */
/** \brief AC object */
typedef volatile struct _Ifx_MINIMCDS_TCX_AC
{
       Ifx_MINIMCDS_TCX_AC_BND             BND;                    /**< \brief 0, Comparator Bound Register ${j}*/
       Ifx_MINIMCDS_TCX_AC_RNG             RNG;                    /**< \brief 4, Comparator Range Register ${j}*/
       Ifx_MINIMCDS_TCX_AC_MSK             MSK;                    /**< \brief 8, Comparator Mask Register ${j}*/
       Ifx_UReg_8Bit                       reserved_C[12];         /**< \brief C, \internal Reserved */
} Ifx_MINIMCDS_TCX_AC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_TCX_IP_struct
 * \{  */
/******************************************************************************/
/** \name Object L6
 * \{  */
/** \brief IP object */
typedef volatile struct _Ifx_MINIMCDS_TCX_IP
{
       Ifx_MINIMCDS_TCX_IP_BND             BND;                    /**< \brief 0, Comparator Bound Register ${j}*/
       Ifx_MINIMCDS_TCX_IP_RNG             RNG;                    /**< \brief 4, Comparator Range Register ${j}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MINIMCDS_TCX_IP;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_TCX_struct
 * \{  */
/******************************************************************************/
/** \name Object L7
 * \{  */
/** \brief TCX object */
typedef volatile struct _Ifx_MINIMCDS_TCX
{
       Ifx_MINIMCDS_TCX_DCSTS              DCSTS;                  /**< \brief 0, Debug Status Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_MINIMCDS_TCX_CIP                CIP;                    /**< \brief 8, Current Instruction Pointer*/
       Ifx_MINIMCDS_TCX_CFT                CFT;                    /**< \brief C, Compact Function Trace Register*/
       Ifx_UReg_8Bit                       reserved_10[1008];      /**< \brief 10, \internal Reserved */
       Ifx_MINIMCDS_TCX_EA                 EA[2];                  /**< \brief 400, */
       Ifx_UReg_8Bit                       reserved_418[104];      /**< \brief 418, \internal Reserved */
       Ifx_MINIMCDS_TCX_WD                 WD[2];                  /**< \brief 480, */
       Ifx_UReg_8Bit                       reserved_4C0[64];       /**< \brief 4C0, \internal Reserved */
       Ifx_MINIMCDS_TCX_AC                 AC[2];                  /**< \brief 500, */
       Ifx_UReg_8Bit                       reserved_524[2780];     /**< \brief 524, \internal Reserved */
       Ifx_MINIMCDS_TCX_IP                 IP[2];                  /**< \brief 1000, */
} Ifx_MINIMCDS_TCX;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief MINIMCDS object */
typedef volatile struct _Ifx_MINIMCDS
{
       Ifx_MINIMCDS_CLC                    CLC;                    /**< \brief 0, Clock Control Register*/
       Ifx_MINIMCDS_OCS                    OCS;                    /**< \brief 4, OCDS Control and Status*/
       Ifx_MINIMCDS_ID                     ID;                     /**< \brief 8, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_MINIMCDS_CT                     CT;                     /**< \brief 10, MCDS Control Register*/
       Ifx_MINIMCDS_MUX                    MUX;                    /**< \brief 14, MCDS Signal Source Control*/
       Ifx_MINIMCDS_MUX_TC_RC              MUX_TC_RC;              /**< \brief 18, MCDS_TC Signal Source Control*/
       Ifx_UReg_8Bit                       reserved_1C[484];       /**< \brief 1C, \internal Reserved */
       Ifx_MINIMCDS_FIFONOW                FIFONOW;                /**< \brief 200, Trace Buffer Write Pointer*/
       Ifx_MINIMCDS_FIFOBOT                FIFOBOT;                /**< \brief 204, Trace Buffer Bottom Register*/
       Ifx_MINIMCDS_FIFOPRE                FIFOPRE;                /**< \brief 208, Trace Buffer PRE/POST Register*/
       Ifx_MINIMCDS_FIFOTOP                FIFOTOP;                /**< \brief 20C, Trace Buffer Top Register*/
       Ifx_MINIMCDS_FIFOCTL                FIFOCTL;                /**< \brief 210, Trace Buffer Control Register*/
       Ifx_MINIMCDS_FIFOWARN               FIFOWARN[2];            /**< \brief 214, Trace Buffer Comparator Register*/
       Ifx_MINIMCDS_FIFOOVRCNT             FIFOOVRCNT;             /**< \brief 21C, FIFO Overflow Counter Register*/
       Ifx_UReg_8Bit                       reserved_220[480];      /**< \brief 220, \internal Reserved */
       Ifx_MINIMCDS_TSUREFCNT              TSUREFCNT;              /**< \brief 400, Clock Counter Register*/
       Ifx_MINIMCDS_TSUPRSCL               TSUPRSCL;               /**< \brief 404, Clock Prescaler Register*/
       Ifx_MINIMCDS_TSUEMUCNT              TSUEMUCNT;              /**< \brief 408, Clock Counter Register*/
       Ifx_UReg_8Bit                       reserved_40C[1012];     /**< \brief 40C, \internal Reserved */
       Ifx_MINIMCDS_MCX                    MCX;                    /**< \brief 800, */
       Ifx_UReg_8Bit                       reserved_A7C[5508];     /**< \brief A7C, \internal Reserved */
       Ifx_MINIMCDS_TCX                    TCX;                    /**< \brief 2000, */
       Ifx_UReg_8Bit                       reserved_3018[20456];    /**< \brief 3018, \internal Reserved */
} Ifx_MINIMCDS;

/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMINIMCDS_REGDEF_H */
